//═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                                                                     //
//                                                             ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                                               //
//                                                                                                                                                     //
//                                                                    Ｖ：１．０．１                                                                     //
//                                                                                                                                                     //
//                                     ░█████╗░██╗░░░░░██╗███████╗███╗░░██╗  ░█████╗░██╗░░░░░███████╗░█████╗░                                          //
//                                     ██╔══██╗██║░░░░░██║██╔════╝████╗░██║  ██╔══██╗██║░░░░░██╔════╝██╔══██╗                                          //
//                                     ███████║██║░░░░░██║█████╗░░██╔██╗██║  ███████║██║░░░░░█████╗░░███████║                                          //
//                                     ██╔══██║██║░░░░░██║██╔══╝░░██║╚████║  ██╔══██║██║░░░░░██╔══╝░░██╔══██║                                          //
//                                     ██║░░██║███████╗██║███████╗██║░╚███║  ██║░░██║███████╗██║░░░░░██║░░██║                                          //
//                                     ╚═╝░░╚═╝╚══════╝╚═╝╚══════╝╚═╝░░╚══╝  ╚═╝░░╚═╝╚══════╝╚═╝░░░░░╚═╝░░╚═╝                                          //
//                                                                                                                                                     //
//                                                                                                                                                     //
//═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════//

// Obfuscated By AlienAlfa
// Unecrypted file Willbe relesed Soon
// Full file will be relised After all BUGS Has been Fixed

// CURRENTLY RUNNING ON BETA VERSION!!
/**
   * MIT License
* 
   * Copyright (c) 2021 Alien-Alfa.
* 
   * Permission is hereby granted, free of charge, to any person obtaining a copy
   * of this software and associated documentation files (the "Software"), to deal
   * in the Software without restriction, including without limitation the rights
   * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
   * copies of the Software, and to permit persons to whom the Software is
   * furnished to do so, subject to the following conditions:
* 
   * The above copyright notice and this permission notice shall be included in all
   * copies or substantial portions of the Software.
* 
   * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
   * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
   * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
   * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
   * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
   * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
   * SOFTWARE.
*/




const fs = require('fs')
const chalk = require('chalk')


var ownernum = ['923206629195']
//-------------


// Website Api
global.APIs = {
	zenz: 'https://zenzapis.xyz',
	devil: 'https://api-toxic-devil.herokuapp.com/api',
} 
 
global.APIKeys = {
	'https://zenzapis.xyz': '' }
    


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


   //---------------------------------------------------------------------

   global.worktype = 'private'

   //---------------------------------------------------------------------
   
   
   //---------------------------------------------------------------------

   global.sudo = ['923206629195']
   //-------------
   global.owner = ['923206629195']

   //---------------------------------------------------------------------
   
   global.packname = 'C O M R A D E ' 
   //-------------
   global.author = 'F A R A Z '

   //---------------------------------------------------------------------


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


   //--------------------- MENU URL BUTTON 1 ------------------------

   global.linkbuttid1 = 'ɪɴꜱᴛᴀɢʀᴀᴍ' 
   //-------------
   global.butturl1 = ''
   
   //---------------------------------------------------------------------



   //--------------------- MENU URL BUTTON 2 ------------------------

   global.linkbuttid2 = 'ʏᴏᴜᴛᴜʙᴇ'
   //-------------
   global.butturl2 = ''
   
   //---------------------------------------------------------------------


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


   //--------------------- ADPLAY OPTIONS ------------------------

   global.linktext = 'ꜱᴜʙꜱᴄʀɪʙᴇ ᴛᴏ ᴍʏ ʏᴏᴜᴛᴜʙᴇ ᴄʜᴀɴɴᴇʟ'
   //-------------
   global.linkurl = ''
   
   //---------------------------------------------------------------------


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


   //--------------------- MAIN IMAGE  ------------------------

   global.profileimage = 'https://i.imgur.com/PJ3Nh6U.jpg'
      
   //---------------------------------------------------------------------

//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	

   //--------------------- URL IMAGE  ------------------------

   global.mainimgurl = 'https://github.com/Alien-alfa/Alien-alfa/blob/beta/Alfa.jpg?raw=true'
      
   //---------------------------------------------------------------------



//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


   //--------------------- MAIN MENU BUTTON ------------------------
   
   global.mlinktxt1 = 'ʜᴏᴡ ᴛᴏ ᴅᴇᴘʟᴏʏ ʙᴏᴛ'
   //-------------
   global.mlinkurl1 = 'https://youtube.com/c/alienalfa'
   //------------- 
   
 //------ URL BUTTON 2 -----
   global.mlinktxt2 = null
   //-------------
   global.mlinkurl2 = null
   //-------------
 
 //------ REP BUTTON 1 -----
   global.mbuttxt1 = 'ᴀʟʟ ᴄᴏᴍᴍᴀɴᴅꜱ'
   //-------------
   global.mbutid1 = 'command'
   //-------------
   
 //------ REP BUTTON 2 -----
   global.mbuttxt2 = null 
   //-------------
   global.mbutid2 = null
   //-------------
   
 //------ REP BUTTON 3 -----
   global.mbuttxt3 = null
   //-------------
   global.mbutid3 = null
   //-------------
   
   //---------------------------------------------------------
   
//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


//============ MAIN ============//

//-------------
global.premium = [`923206629195`]
//-------------
global.sessionName = 'session.alfa'
//-------------
global.prefa = ['','!','.','🐦','🐤','🗿']
//-------------
global.sp = '𒆜'
//-------------
global.devname = C O M R A D E  F A R A Z '
//-------------
global.devNum = ['923206629195']
//-------------
global.greetings = 'Hey  👋🏻'
//-------------
global.listicon = '✩' 
//-------------
global.wm = 'C O M R A D E  F A R A Z' 
//-------------
global.botname = 'C O M R A D E  F A R A Z'
//-------------
global.icon = '✩' 
//-------------
global.mail = 'farazjanbaloch222@gmail.com'
//-------------
global.youtube = 'https://youtube.com/c/alienalfa'
//-------------
global.github = 'https://github.com/Alien-alfa/' 
//-------------
global.insta = '' 
//-------------
global.linkname = 'C O M R A D E  F A R A Z'
//-------------
global.mainfooter = 'C O M R A D E  F A R A Z' 
//-------------
global.herokuapi = '' 
//-------------
global.herokuapp = '' 


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


//============ Modz ============//

//-------------
global.welcomeactive =  false
//-------------
global.alivemess = true
//-------------
global.aliveimage = ftrue
//-------------
global.speedmode =  'active'
//-------------
global.ownermess = 'YE MERA OWNER HAI BHAI'
//-------------
global.autoread = false 
//-------------
global.anticall = false 
//-------------





global.thumb = fs.readFileSync('./lib/lowdb/adapters/alfa.jpg')

global.mess = {
    success: 'DOMNE',
    errr: 'YAR ERROR AGYA ',
    admin: 'ᴏɴʟʏ ᴀᴅᴍɪɴ',
    botAdmin: 'ADMIN TO BANA BSDK',
    owner: 'OWNER KA COMMAND HAI TU Q DAL RHA HAI',
    group: 'GROUP SAMJHA HAI KIYA YHAN',
    private: 'ARE GROUP HAI YAR PRIVATE MAI CHALA LE ',
    bot: '',
    wait: 'WAIMT KAR ',
    endLimit: 'ʏᴏᴜʀ ᴅᴀɪʟʏ ʟɪᴍɪᴛ ʜᴀꜱ ᴇxᴘɪʀᴇᴅ, ᴛʜᴇ ʟɪᴍɪᴛ ᴡɪʟʟ ʙᴇ ʀᴇꜱᴇᴛ ᴇᴠᴇʀʏ 12 ʜᴏᴜʀꜱ',
    notext: 'ᴇɴᴛᴇʀ ꜱᴇᴀʀᴄʜ ʟɪɴᴋꜱ!',
}
global.limitawal = {
    premium: "Infinity",
    free: 100
}


let file = require.resolve(__filename)
fs.watchFile(file, () => {
	fs.unwatchFile(file)
	console.log(chalk.redBright(`Update'${__filename}'`))
	delete require.cache[file]
	require(file)
})
